<template>
    <div class="site-description">
        <h1 class="text-center">О сайте "MyFaculty"</h1>
        <p class="info-text">
            Сайт "Интерактивная карта факультета" был основан 16 июня 2022 года в рамках производственной
            практической работы 3-го курса. Цель сайта - помогать студентам, абитуриентам и просто гостям
            физико-технического факультета ориентироваться в здании этого факультета, а также предоставлять информацию
            касательно преподавателей, аудиторий, пар и факультета в целом. Любой посетитель сайта сможет детально
            ознакомиться с планом этажей на факультете, благодаря возможности векторного масштабирования отображаемой
            карты, информацией о преподавателях и читаемых ими дисциплинах, а также расписанием пар для интересующего
            посетителя курса и группы. Вся необходимая информация отображается при навигации пользователя по
            tab-вкладкам
            на сайте, без постоянных перезагрузок страницы.
        </p>
        <p class="info-text">
            Локальный успех сайта, выраженный в максимально возможной оценке за производственную практику дал
            возможность понять, что у ресурса есть потенциал и он может гораздо больше. 1-го августа 2022 года было
            принято решение решение модернизировать сайт, переписав его с помощью более совершенных технологий, так
            серверная часть приложения была переписана с Laravel на ASP.NET Core, клиентская часть стала обособленным
            Vue.js приложением.
        </p>
        <p class="info-text">
            Однако дальше стало понятно, что ресурс может и должен быть масштабирован. Так, из простого одностраничника
            с навигацией по физико-техническому факультету и информацией о нем сайт стал масштабным сервисом, призванным
            помогать студентам всех факультетов Донецкого государственного университета, предоставляя им функционал,
            ранее доступный только студентам физико-технического факультета.
        </p>
        <p class="info-text">
            Но мы не собирались останавливаться и на этом! Создание удобного университетского справочника это хорошо, но
            что если пойти дальше? Ввиду несостоятельности и морально-технологического устаревания средств
            дистанционного обучения создание современной платформы для этих целей было бы крайне уместно. Поэтому в
            рамках данного сервиса был создан личный кабинет пользователей, в котором студенты и преподаватели могли бы
            обмениваться информацией в ненавязчивой обстановке, родственной всем привычным социальным сетям. Объединение
            студентов и преподавателей в рамках процесса дистанционного обучения и простой коммуникации - уникальная
            идея, отличающая наш ресурс от других платформ, в том числе и от социальных сетей, ставших гигантами
            индустрии (изначально все они планировали объединять между собой только студентов).
        </p>
        <p class="info-text">
            Обладая современным дизайном и всем необходимым для реализации поставленных целей функционалом наш сайт
            уникален в своем роде, и представляет собой лучшую площадку для коммуникации в рамках ДонГУ!
        </p>
        <h1 class="text-center">Вопросы и ответы</h1>
        <v-col cols="12" class="m-0">
            <v-expansion-panels
                dark
                accordion
            >
                <v-expansion-panel>
                    <v-expansion-panel-header class="question">
                        Обязательна ли регистрация?
                    </v-expansion-panel-header>
                    <v-expansion-panel-content class="answer">
                        <p>
                            Если Вы не планируете как-либо взаимодействовать с университетом в рамках дистанционного
                            обучения, то можно пользоваться сайтом как обычным справочным ресурсом без регистрации
                            (однако она рекомендуется, так как сайт представляет множество полезных функций, не
                            связанных с дистанционным обучением).
                        </p>
                        <p>
                            Гостевым пользователям доступен просмотр интерактивных карт этажей
                            факультетов, списка преподавателей, расписания пар для выбранной группы, а также
                            взаимодействие с рекомендательным модулем по выбору факультета и специальности, который
                            может помочь особо сомневающимся абитуриентам. Однако для большего погружения в жизнь
                            университета регистрация не помешает!
                        </p>
                    </v-expansion-panel-content>
                </v-expansion-panel>
                <v-expansion-panel>
                    <v-expansion-panel-header class="question">
                        Что я получу после регистрации?
                    </v-expansion-panel-header>
                    <v-expansion-panel-content class="answer">
                        <p>
                            После регистрации Вам будет открыт доступ в личный кабинет. В нем Вы сможете найти
                            интересующие информационные сообщества, которые помогут Вам лучше погрузиться в жизнь
                            университета, особенно если Вы первокурсник или абитуриент. Также Вы сможете ознакомиться с
                            сообществами курсов, создаваемыми преподавателями и представляющими сильный инструмент в
                            реализации целей дистанционного обучения. Во время дистанционного обучения Вы сможете
                            оставлять свои решения к заданиям в рамках этих сообществ, и получать отклик на них.
                            Благодаря открытой возможности комментирования записей любой студент может задать вопрос по
                            заданию и получить ответ, который может стать актуальным для множества других студентов,
                            столкнувшихся с аналогичной проблемой! В рамках информационных сообществ также можно
                            общаться в комментариях к записям и еще сильнее открывать для себя мир ДонГУ! Лента новостей
                            также поможет Вам оставаться в курсе последних интересующих Вас событий.
                        </p>
                    </v-expansion-panel-content>
                </v-expansion-panel>
                <v-expansion-panel>
                    <v-expansion-panel-header class="question">
                        Я зарегистрировался, но приложение предлагает ввести дополнительные данные обо мне.
                        Безопасно ли это?
                    </v-expansion-panel-header>
                    <v-expansion-panel-content class="answer">
                        <p>
                            Конечно! Ввод некоторых данных (дата рождения, город, страна, VK, Telegram, email, личный
                            сайт) опционален и предназначен для того, чтобы пользователи ресурса могли лучше узнать друг
                            о друге, наладить более плотную коммуникацию.
                        </p>
                        <p>
                            Ввод данных о факультете, курсе и группе пользователя также соответствует удовлетворению
                            вышеперечисленных целей, но вдобавок упростит работу самому пользователю. Так, ему будет
                            доступно расписание пар для его группы, автоматический трансфер из одной группы в другую по
                            окончании учебного года, без необходимости редактировать профиль, а также автоматическое
                            добавление / исключение в актуальные сообщества курсов.
                        </p>
                        <p>
                            В рекламных целях, либо любых других, граничащих с принципами добросовестного использования
                            личных данных, информация из профилей пользователей использоваться не будет!
                        </p>
                    </v-expansion-panel-content>
                </v-expansion-panel>
                <v-expansion-panel>
                    <v-expansion-panel-header class="question">
                        Меня интересуют алгоритмы работы системы и реальные политики обработки публикуемой мной
                        информацией. Могу ли я получить информацию об этом?
                    </v-expansion-panel-header>
                    <v-expansion-panel-content class="answer">
                        <p>
                            Да. Весь исходный код системы открыт и доступен для ознакомления, его можно найти по  <a
                            href="https://github.com/EliseevVadim/MyFaculty">ссылке</a>. Однако использование этого кода
                            в коммерческих целях, без личного согласования с
                            <a href="https://vk.com/lord_ajdis">создателем</a> сайта запрещено. Кроме того, Вы можете
                            ознакомиться с <a :href="apiUrl">документацией</a> API системы, оформленной в виде Swagger.
                        </p>
                    </v-expansion-panel-content>
                </v-expansion-panel>
                <v-expansion-panel>
                    <v-expansion-panel-header class="question">
                        Я - преподаватель. Доступны ли мне какие-то уникальные функции?
                    </v-expansion-panel-header>
                    <v-expansion-panel-content class="answer">
                        <p>
                            Да. Однако эти функции доступны только после подтверждения своего преподавательского статуса
                            на сайте. Для этого необходимо зарегистрироваться со своей официальной почты, которая
                            указана в справочном разделе в графе с информацией о преподавателях. Важно! Почта, указанная
                            в этой графе является общедоступной и любой посетитель сайта сможет узнать ее, что было
                            сделано в целях предоставления всем равных условий при первой связи с преподавателем, а не
                            только узкому кругу старост. После регистрации Вам необходимо запросить токен подтверждения
                            у администратора системы, который будет прислан на Вашу электронную почту. Получив токен,
                            Вы сможете подтвердить свой преподавательский статус, проследовав инструкциям в личном
                            кабинете.
                        </p>
                    </v-expansion-panel-content>
                </v-expansion-panel>
                <v-expansion-panel>
                    <v-expansion-panel-header class="question">
                        Бесплатно ли пользоваться сайтом?
                    </v-expansion-panel-header>
                    <v-expansion-panel-content class="answer">
                        <p>
                            Конечно! Любой пользователь может зарегистрироваться и получить доступ к необходимому
                            функционалу. В будущем, возможно введение платных функций, которые будут носить
                            косметический характер и никак не повлияют на пользователей, бесплатно пользующихся сайтом.
                            Целью таких функций будет предоставление возможности пользователям поддержать сайт
                            финансово.
                        </p>
                    </v-expansion-panel-content>
                </v-expansion-panel>
                <v-expansion-panel>
                    <v-expansion-panel-header class="question">
                        Мне очень нравится Ваш сайт! Как я могу ему помочь?
                    </v-expansion-panel-header>
                    <v-expansion-panel-content class="answer">
                        <p>
                            Если Вам действительно нравится на сайт, Вы можете порекомендовать его своим знакомым, особенно,
                            если они собираются поступать, либо уже учатся в ДонГУ. Ведь чем больше пользователей будет у
                            сайта, тем выше он будет подниматься в поисковой выдаче, и соответственно будет выше активность,
                            что вдохновит нас на дальнейшую его разработку и совершенствование.
                        </p>
                        <p>
                            Если Вы являетесь
                            пользователем Github, Вы также можете поставить звездочку на
                            <a href="https://github.com/EliseevVadim/MyFaculty">официальный репозиторий</a> ресурса, что
                            также является хорошей поддержкой для разработчика. В данный момент сайт не имеет монетизации,
                            поэтому Вы можете спокойно пользоваться им, не задумываясь об этой стороне жизни ресурса!
                        </p>
                    </v-expansion-panel-content>
                </v-expansion-panel>
            </v-expansion-panels>
        </v-col>
        <p class="info-text mb-4 pt-1">
            Лицам, претендующим на должность администратора системы необходимо обратиться к уполномоченным лицам на
            кафедре компьютерных технологий факультета, либо же напрямую к <a
            href="https://vk.com/lord_ajdis">создателю</a> сайта, после чего
            будет произведена регистрация администратора и выдача всех необходимых для работы данных.
        </p>
    </div>
</template>

<script>
import {config} from "@/config/config";
export default {
    name: "AboutPageContainer",
    data() {
        return {
            apiUrl: config.apiUrl
        }
    }
}
</script>

<style scoped lang="scss">
    h1 {
        color: white;
        padding-top: 10px;
    }
    .site-description {
        margin-top: -16px;
        margin-bottom: 0;
        background: black;
        height: calc(100% + 16px);
    }
    .info-text {
        color: white;
        padding: 20px 20px 0;
        text-indent: 25px;
        text-align: left;
        font-family: sf-regular;
    }
    a {
        color: white !important;
    }
    .question {
        font-weight: bolder;
        font-size: 20px;
        color: lime;
    }
    .answer {
        & p {
            text-align: left;
            text-indent: 25px;
            margin: 0;
            padding: 0;
        }
    }
</style>