<template>
    <div class="test">
        <h1 class="text-center">О сайте "Интерактивная карта факультета"</h1>
        <p class="text-center info-text">
            Сайт "Интерактивная карта факультета" был основан 16 июня 2022 года в рамках производственной
            практической работы 3-го курса. Цель сайта - помогать студентам, абитуриентам и просто гостям
            физико-технического факультета ориентироваться в здании этого факультета, а также предоставлять информацию
            касательно преподавателей, аудиторий, пар и факультета в целом. Любой посетитель сайта сможет детально
            ознакомиться с планом этажей на факультете, благодаря возможности векторного масштабирования отображаемой
            карты, информацией о преподавателях и читаемых ими дисциплинах, а также расписанием пар для интересующего
            посетителя курса и группы. Вся необходимая информация отображается при навигации пользователя по
            tab-вкладкам
            на сайте, без постоянных перезагрузок страницы.
        </p>
        <p class="text-center info-text">
            Лицам, претендующим на должность администратора системы необходимо обратиться к уполномоченным лицам на
            кафедре компьютерных технологий факультета, либо же напрямую к <a
            href="https://vk.com/lord_ajdis">создателю</a> сайта, после чего
            будет произведена регистрация администратора и выдача всех необходимых для работы данных.
        </p>
    </div>
</template>

<script>
export default {
    name: "InfoPageContent"
}
</script>

<style scoped>
h1 {
    color: white;
    padding-top: 10px;
}

.test {
    margin-top: -16px;
    margin-bottom: 0;
    background: black;
    height: calc(100% + 16px);
}

.info-text {
    color: white;
    padding: 20px;
}

a {
    color: white !important;
}
</style>